results/microhttpd_02.txt
Running 20s test @ http://localhost:8080/
  12 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   288.70us  506.84us  13.24ms   91.89%
    Req/Sec    44.57k    17.98k   88.01k    64.92%
  Latency Distribution
     50%  126.00us
     75%  232.00us
     90%  646.00us
     99%    2.74ms
  10648600 requests in 20.03s, 1.36GB read
Requests/sec: 531719.60
Transfer/sec:     69.47MB