results/nim_pr_mnsgc_02.txt
Running 20s test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45ms  375.91us  20.14ms   82.75%
    Req/Sec    17.26k     2.71k   58.74k    74.41%
  Latency Distribution
     50%    1.26ms
     75%    1.74ms
     90%    1.88ms
     99%    2.50ms
  1375530 requests in 20.10s, 98.39MB read
Requests/sec:  68434.77
Transfer/sec:      4.89MB