results/nim_pr_rc_04.txt
Running 20s test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.28ms    1.39ms  45.67ms   88.33%
    Req/Sec    11.99k   605.32    13.01k    67.75%
  Latency Distribution
     50%    1.72ms
     75%    1.85ms
     90%    4.49ms
     99%    7.09ms
  954770 requests in 20.02s, 68.29MB read
Requests/sec:  47696.23
Transfer/sec:      3.41MB