results/vibed_04.txt
Running 20s test @ http://localhost:8080/
  12 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.85ms   16.54ms 264.25ms   98.79%
    Req/Sec     6.44k     1.80k   12.42k    58.72%
  Latency Distribution
     50%    1.17ms
     75%    1.63ms
     90%    2.11ms
     99%   46.41ms
  1535817 requests in 20.10s, 256.32MB read
Requests/sec:  76408.57
Transfer/sec:     12.75MB